movies_api/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" INNER JOIN "actors_movies" ON "movies"."id" = "actors_movies"."movie_id" WHERE "actors_movies"."actor_id" = $1  [["actor_id", 4]]
SELECT  1 AS one FROM "movies" INNER JOIN "actors_movies" ON "movies"."id" = "actors_movies"."movie_id" WHERE "actors_movies"."actor_id" = $1 AND "movies"."id" = $2 LIMIT $3  [["actor_id", 4], ["id", 2], ["LIMIT", 1]]
---
  def show
    @movies = @actor.movies
    if @movies.include?(@movie)

INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Hamlet"], ["created_at", "2019-05-28 20:03:30.136960"], ["updated_at", "2019-05-28 20:03:30.136960"]]
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

UPDATE "movies" SET "title" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["title", "Hamlet (Not Really)"], ["updated_at", "2019-05-28 20:04:50.240976"], ["id", 1]]
---
  def update
    if @movie.update(movie_params)

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def get_actor
    @actor = Actor.find(params[:actor_id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def get_movie
    @movie = Movie.find(params[:id])