books_db_api/app/controllers/books_controller.rb

  def index
    @author = Author.find(params[:author_id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @author = Author.find(params[:author_id])
    @book = Book.find(params[:id])
    @books = @author.books
    if @author.books.include?(@book)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" INNER JOIN "authors_books" ON "books"."id" = "authors_books"."book_id" WHERE "authors_books"."author_id" = $1  [["author_id", 1]]
SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = $1  [["book_id", 3]]
SELECT  1 AS one FROM "books" INNER JOIN "authors_books" ON "books"."id" = "authors_books"."book_id" WHERE "authors_books"."author_id" = $1 AND "books"."id" = $2 LIMIT $3  [["author_id", 2], ["id", 1], ["LIMIT", 1]]